app/controllers/api/v1/recipes_controller.rb

  def index
    recipe = Recipe.all.order(created_at: :desc)
---
SELECT "recipes".* FROM "recipes" ORDER BY "recipes"."created_at" DESC

  def create
    recipe = Recipe.create!(recipe_params)
---
INSERT INTO "recipes" ("name", "ingredients", "instruction", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "test"], ["ingredients", "test"], ["instruction", "est"], ["created_at", "2022-03-19 06:27:04.369408"], ["updated_at", "2022-03-19 06:27:04.369408"]]

  def update
    recipe.update(recipe_params)
---
UPDATE "recipes" SET "name" = $1, "ingredients" = $2, "instruction" = $3, "updated_at" = $4 WHERE "recipes"."id" = $5

  def destroy
    recipe&.destroy
---
DELETE FROM "recipes" WHERE "recipes"."id" = $1  [["id", 38]]

  def recipe
    @recipe ||= Recipe.find(params[:id])
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 37], ["LIMIT", 1]]